anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/boot_rom/f28002x/rev0/rom_sources/F28002x_ROM/driverlib/sysctl.h
    // PCLKCR4
    SYSCTL_PERIPH_CLK_EQEP1      = 0x0004,  //!< eQEP1 clock
    SYSCTL_PERIPH_CLK_EQEP2      = 0x0104,  //!< eQEP2 clock


    // PCLKCR7
    SYSCTL_PERIPH_CLK_SCIA       = 0x0007,  //!< SCIA clock

    // PCLKCR8
    SYSCTL_PERIPH_CLK_SPIA       = 0x0008,  //!< SPIA clock
    SYSCTL_PERIPH_CLK_SPIB       = 0x0108,  //!< SPIB clock

    // PCLKCR9
    SYSCTL_PERIPH_CLK_I2CA       = 0x0009,  //!< I2CA clock
    SYSCTL_PERIPH_CLK_I2CB       = 0x0109,  //!< I2CB clock

    // PCLKCR10
    SYSCTL_PERIPH_CLK_CANA       = 0x000A,  //!< CANA clock

    // PCLKCR13
    SYSCTL_PERIPH_CLK_ADCA       = 0x000D,  //!< ADCA clock
    SYSCTL_PERIPH_CLK_ADCC       = 0x020D,  //!< ADCC clock

    // PCLKCR14
    SYSCTL_PERIPH_CLK_CMPSS1     = 0x000E,  //!< CMPSS1 clock
    SYSCTL_PERIPH_CLK_CMPSS2     = 0x010E,  //!< CMPSS2 clock
    SYSCTL_PERIPH_CLK_CMPSS3     = 0x020E,  //!< CMPSS3 clock
    SYSCTL_PERIPH_CLK_CMPSS4     = 0x030E,  //!< CMPSS4 clock

    // PCLKCR17
    SYSCTL_PERIPH_CLK_CLB1       = 0x0011,  //!< CLB1 clock
    SYSCTL_PERIPH_CLK_CLB2       = 0x0111,  //!< CLB2 clock

    // PCLKCR18
    SYSCTL_PERIPH_CLK_FSITXA     = 0x0012,  //!< FSITXA clock
    SYSCTL_PERIPH_CLK_FSIRXA     = 0x0112,  //!< FSIRXA clock

    // PCLKCR19
    SYSCTL_PERIPH_CLK_LINA       = 0x0013,  //!< LINA clock
    SYSCTL_PERIPH_CLK_LINB       = 0x0113,  //!< LINB clock

    // PCLKCR20
    SYSCTL_PERIPH_CLK_PMBUSA     = 0x0014,  //!< PMBusA clock

	
    // PCLKCR21
    SYSCTL_PERIPH_CLK_DCC0       = 0x0015,  //!< DCC0 clock
    SYSCTL_PERIPH_CLK_DCC1       = 0x0115,  //!< DCC1 clock
	
	// PCLKCR24
    SYSCTL_PERIPH_CLK_CPUCRC     = 0x0018,  //!< CPU CRC clock
	
	// PCLKCR25
    SYSCTL_PERIPH_CLK_HICA       = 0x0019   //!< HIC clock
	
} SysCtl_PeripheralPCLOCKCR;
//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_resetPeripheral() as
//! the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{

    // SOFTPRES2
    SYSCTL_PERIPH_RES_EPWM1      = 0x0002,  //!< Reset ePWM1
    SYSCTL_PERIPH_RES_EPWM2      = 0x0102,  //!< Reset ePWM2
    SYSCTL_PERIPH_RES_EPWM3      = 0x0202,  //!< Reset ePWM3
    SYSCTL_PERIPH_RES_EPWM4      = 0x0302,  //!< Reset ePWM4
    SYSCTL_PERIPH_RES_EPWM5      = 0x0402,  //!< Reset ePWM5
    SYSCTL_PERIPH_RES_EPWM6      = 0x0502,  //!< Reset ePWM6
    SYSCTL_PERIPH_RES_EPWM7      = 0x0602,  //!< Reset ePWM7

    // SOFTPRES3
    SYSCTL_PERIPH_RES_ECAP1      = 0x0003,  //!< Reset eCAP1
    SYSCTL_PERIPH_RES_ECAP2      = 0x0103,  //!< Reset eCAP2
    SYSCTL_PERIPH_RES_ECAP3      = 0x0203,  //!< Reset eCAP3

    // SOFTPRES4
    SYSCTL_PERIPH_RES_EQEP1      = 0x0004,  //!< Reset eQEP1
    SYSCTL_PERIPH_RES_EQEP2      = 0x0104,  //!< Reset eQEP2


    // SOFTPRES7
    SYSCTL_PERIPH_RES_SCIA       = 0x0007,  //!< Reset SCIA

    // SOFTPRES8
    SYSCTL_PERIPH_RES_SPIA       = 0x0008,  //!< Reset SPIA
    SYSCTL_PERIPH_RES_SPIB       = 0x0108,  //!< Reset SPIB

    // SOFTPRES9
    SYSCTL_PERIPH_RES_I2CA       = 0x0009,  //!< Reset I2CA
    SYSCTL_PERIPH_RES_I2CB       = 0x0109,  //!< Reset I2CB

    // SOFTPRES10
    SYSCTL_PERIPH_RES_CANA       = 0x000A,  //!< Reset CANA

    // SOFTPRES13
    SYSCTL_PERIPH_RES_ADCA       = 0x000D,  //!< Reset ADCA
    SYSCTL_PERIPH_RES_ADCC       = 0x020D,  //!< Reset ADCC

    // SOFTPRES14
    SYSCTL_PERIPH_RES_CMPSS1     = 0x000E,  //!< Reset CMPSS1
    SYSCTL_PERIPH_RES_CMPSS2     = 0x010E,  //!< Reset CMPSS2
    SYSCTL_PERIPH_RES_CMPSS3     = 0x020E,  //!< Reset CMPSS3
    SYSCTL_PERIPH_RES_CMPSS4     = 0x030E,  //!< Reset CMPSS4

    // SOFTPRES17
    SYSCTL_PERIPH_RES_CLB1       = 0x0011,  //!< Reset CLB1
    SYSCTL_PERIPH_RES_CLB2       = 0x0111,  //!< Reset CLB2

    // SOFTPRES18
    SYSCTL_PERIPH_RES_FSITXA     = 0x0012,  //!< Reset FSITXA
    SYSCTL_PERIPH_RES_FSIRXA     = 0x0112,  //!< Reset FSIRXA

    // SOFTPRES19
    SYSCTL_PERIPH_RES_LINA       = 0x0013,  //!< Reset LINA
    SYSCTL_PERIPH_RES_LINB       = 0x0113,  //!< Reset LINB

    // SOFTPRES20
    SYSCTL_PERIPH_RES_PMBUSA     = 0x0014,  //!< Reset PMBusA

    // SOFTPRES21
    SYSCTL_PERIPH_RES_DCC0       = 0x0015,  //!< Reset DCC0
    SYSCTL_PERIPH_RES_DCC1       = 0x0115,  //!< Reset DCC1
	
	// SOFTPRES22
    SYSCTL_PERIPH_RES_PBIST_0    = 0x0116,  //!< Reset PBIST
	
	// SOFTPRES24
    SYSCTL_PERIPH_RES_CPUCRC     = 0x0118,  //!< Reset CPU CRC

} SysCtl_PeripheralSOFTPRES;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_isPeripheralPresent()
//! as the \e peripheral parameter.
//
//*****************************************************************************
typedef enum
{
    // DC1
    SYSCTL_PERIPH_PRESENT_FPU_TMU = 0x0000,

    // DC3
    SYSCTL_PERIPH_PRESENT_EPWM1  = 0x0002,
    SYSCTL_PERIPH_PRESENT_EPWM2  = 0x0102,
    SYSCTL_PERIPH_PRESENT_EPWM3  = 0x0202,
    SYSCTL_PERIPH_PRESENT_EPWM4  = 0x0302,
    SYSCTL_PERIPH_PRESENT_EPWM5  = 0x0402,
    SYSCTL_PERIPH_PRESENT_EPWM6  = 0x0502,
    SYSCTL_PERIPH_PRESENT_EPWM7  = 0x0602,

    // DC4
    SYSCTL_PERIPH_PRESENT_ECAP1  = 0x0003,
    SYSCTL_PERIPH_PRESENT_ECAP2  = 0x0103,
    SYSCTL_PERIPH_PRESENT_ECAP3  = 0x0203,

    // DC5
    SYSCTL_PERIPH_PRESENT_EQEP1  = 0x0004,
    SYSCTL_PERIPH_PRESENT_EQEP2  = 0x0104,

    // DC7
    SYSCTL_PERIPH_PRESENT_SD1    = 0x0006,

    // DC8
    SYSCTL_PERIPH_PRESENT_SCIA   = 0x0007,

    // DC9
    SYSCTL_PERIPH_PRESENT_SPIA   = 0x0008,
    SYSCTL_PERIPH_PRESENT_SPIB   = 0x0108,

    // DC10
    SYSCTL_PERIPH_PRESENT_I2CA   = 0x0009,
    SYSCTL_PERIPH_PRESENT_I2CB   = 0x0109,

    // DC11
    SYSCTL_PERIPH_PRESENT_CANA   = 0x000A,

    // DC14
    SYSCTL_PERIPH_PRESENT_ADCA   = 0x000D,
    SYSCTL_PERIPH_PRESENT_ADCC   = 0x020D,

    // DC15
    SYSCTL_PERIPH_PRESENT_CMPSS1 = 0x000E,
    SYSCTL_PERIPH_PRESENT_CMPSS2 = 0x010E,
    SYSCTL_PERIPH_PRESENT_CMPSS3 = 0x020E,
    SYSCTL_PERIPH_PRESENT_CMPSS4 = 0x030E,



    // DC18
    SYSCTL_PERIPH_PRESENT_LS4_1  = 0x0411,
    SYSCTL_PERIPH_PRESENT_LS5_1  = 0x0511,
    SYSCTL_PERIPH_PRESENT_LS6_1  = 0x0611,
    SYSCTL_PERIPH_PRESENT_LS7_1  = 0x0711,


    // DC20
    SYSCTL_PERIPH_PRESENT_GS0    = 0x0013,

